import streamlit as st

# 1. 성별
# 2. 성격
# 3. 가치관
# 4. 특징
# 5. 취향
st.title("추구미 가이드")

st.write("당신의 성별을 알려주세요")
gender = st.radio("", ["남", "여"], index=None, label_visibility="collapsed")

st.write("당신의 성격을 알려주세요")
personality = st.multiselect(
    "",
    [
        "활발한",
        "친절한",
        "사교적인",
        "외향적인",
        "자신감 있는",
        "낙관적인",
        "긍정적인",
        "창의적인",
        "결단력 있는",
        "진취적인",
        "독립적인",
        "책임감 있는",
        "신중한",
        "침착한",
        "성실한",
        "꼼꼼한",
        "차분한",
        "공감하는",
        "이해심 많은",
        "공손한",
        "정직한",
        "유머러스한",
        "겸손한",
        "용기 있는",
        "인내심 있는",
        "호기심 많은",
        "유연한",
        "체계적인",
        "계획적인",
        "협력적인",
    ],
    default=None,
    max_selections=5,
    label_visibility="collapsed",
)


st.write("당신의 가치관을 알려주세요")
view = st.multiselect(
    "",
    [
        "존중하는",
        "공정한",
        "정의로운",
        "평등한",
        "책임감 있는",
        "자율적인",
        "독립적인",
        "창의적인",
        "혁신적인",
        "지속 가능한",
        "친환경적인",
        "도덕적인",
        "정직한",
        "신뢰할 수 있는",
        "투명한",
        "헌신적인",
        "배려하는",
        "자비로운",
        "용서하는",
        "관대한",
        "성실한",
        "희생적인",
        "애국적인",
        "공동체적인",
        "협력적인",
        "교육적인",
        "문화적인",
        "인도적인",
        "균형 잡힌",
        "긍정적인",
    ],
    default=None,
    max_selections=5,
    label_visibility="collapsed",
)

st.write("당신의 특징을 알려주세요")
character = st.multiselect(
    "",
    [
        "창의적인",
        "감각적인",
        "혁신적인",
        "분석적인",
        "논리적인",
        "객관적인",
        "주관적인",
        "직관적인",
        "열정적인",
        "활동적인",
        "자발적인",
        "계획적인",
        "체계적인",
        "꼼꼼한",
        "집중력 있는",
        "결단력 있는",
        "신뢰할 수 있는",
        "자립적인",
        "적극적인",
        "융통성 있는",
        "적응력 있는",
        "사교적인",
        "이해심 있는",
        "친절한",
        "유머러스한",
        "독창적인",
        "실용적인",
        "헌신적인",
        "목표 지향적인",
        "감정적인",
    ],
    default=None,
    max_selections=5,
    label_visibility="collapsed",
)

st.write("당신의 취향을 알려주세요")
taste = st.multiselect(
    "",
    [
        "클래식한",
        "현대적인",
        "빈티지한",
        "미니멀한",
        "화려한",
        "단순한",
        "색다른",
        "전통적인",
        "고급스러운",
        "실용적인",
        "감각적인",
        "자연친화적인",
        "독특한",
        "세련된",
        "편안한",
        "모던한",
        "러스틱한",
        "도시적인",
        "시골적인",
        "인더스트리얼한",
        "아트적인",
        "컨템포러리한",
        "복고풍의",
        "스포티한",
        "에코적인",
        "엘레강스한",
        "소박한",
        "다채로운",
        "기능적인",
        "우아한",
    ],
    default=None,
    max_selections=5,
    label_visibility="collapsed",
)


done = st.button("결과 보기")

if done:
    st.write("당신의 추구미는 다음과 같습니다.")
    st.write(f"성격: " + " ".join(personality))
    st.write(f"가치관: " + " ".join(view))
    st.write(f"특징: " + " ".join(character))
    st.write(f"취향: " + " ".join(taste))
